artifactsdoubleblind-sys/Regulation_Aware_LoRa_Transmission/STM32_Project/SX1276_Driver/Src/stm32_SX1276_spi.c
/**
 ****************************************************************************
 * @file		stm32_SX1276_spi.c
 * @author		Soumadeep De
 * @brief		Driver for SX1276 LoRa module.
 ****************************************************************************
 * @notes
 * 				- SPI communication needs to be init in the main function.
 *
 */
#include "main.h"
#include "stdio.h"
#include "string.h"
#include <math.h>
#include "stm32_SX1276_spi.h"

SX1276_StatusTypeDef SX1276_Receiver_RunSyncSchedule(SPI_SX1276_TypeDef hSPI_SX1276,
		uint8_t *pDataTx,
		uint8_t *pDataRx,
		uint8_t TxDataLength,
		uint8_t *LengthOfDataReceived,
		uint32_t LoRaFrequnecy_KHz,
		uint8_t TxPower,
		SX1276_CommParam sCommParam)
{


	SX1276_StatusTypeDef ret;

	// 1) Config Rx
	ret = SX1276_Multi_Receiver_Contineous_SetConfiguration(hSPI_SX1276, LoRaFrequnecy_KHz, sCommParam);

	if(ret !=SX1276_OK)
	{
		return ret;
	}


	// 2) Receive Data; Stay in receiving mode till you hear something
	ret = SX1276_Multi_Receiver_Contineous_Receive(hSPI_SX1276, pDataRx, LengthOfDataReceived);
	if(ret !=SX1276_OK)
	{
		return ret;
	}

	// 3) 100 msec delay
	HAL_Delay(100);

	// 4) Tx Config, ~90ms to execute
	ret = SX1276_Multi_Transmitter_SetConfiguration(hSPI_SX1276, pDataTx, TxDataLength, LoRaFrequnecy_KHz, TxPower, sCommParam);
	if(ret !=SX1276_OK)
	{
		return ret;
	}

	// 5) Transmit data ~funcToA to execute
	ret = SX1276_Multi_Transmitter_Transmit(hSPI_SX1276, TxDataLength, SYNC_MODE_MCU_HAL_DELAY, sCommParam);
	if(ret !=SX1276_OK)
	{
		return ret;
	}

	return SX1276_OK;
}


SX1276_StatusTypeDef SX1276_Transmitter_RunSyncSchedule(SPI_SX1276_TypeDef hSPI_SX1276,
		uint8_t *pDataTx,
		uint8_t *pDataRx,
		uint8_t TxDataLength,
		uint8_t *LengthOfDataReceived,
		uint32_t LoRaFrequnecy_KHz,
		uint8_t TxPower,
		float *ConfigRxTime,
		float *ReceivePropDelay,
		SX1276_CommParam sCommParam,
		TIM_HandleTypeDef *htim,
		uint32_t TIM_PRESCALR)
{
	SX1276_StatusTypeDef ret;
	// 1) Tx Config, ~90ms to execute
	ret = SX1276_Multi_Transmitter_SetConfiguration(hSPI_SX1276, pDataTx, TxDataLength, LoRaFrequnecy_KHz, TxPower, sCommParam);
	if(ret !=SX1276_OK)
	{
		return ret;
	}


	// 2) Wait for 100 ms
	MCU_STOP_Delay_ms(100, hSPI_SX1276.hrtc_l);

	// 3) Transmit data ~funcToA to execute
	ret = SX1276_Multi_Transmitter_Transmit(hSPI_SX1276, TxDataLength, SYNC_MODE_MCU_HAL_DELAY, sCommParam);
	if(ret !=SX1276_OK)
	{
		return ret;
	}

	/*
	 * Calculate Config Rx time
	 */
	// Reset counter to zero before starting for easier timing
	__HAL_TIM_SET_COUNTER(htim, 0);

	HAL_TIM_Base_Start(htim);

	ret = SX1276_Multi_Receiver_Contineous_SetConfiguration(hSPI_SX1276, LoRaFrequnecy_KHz, sCommParam);

	if(ret !=SX1276_OK)
	{
		return ret;
	}

	uint32_t end = __HAL_TIM_GET_COUNTER(htim);

	HAL_TIM_Base_Stop(htim);

	*ConfigRxTime= end*(TIM_PRESCALR*1.0*1e3/ GetTimerClkFromHW());
	end=0;

	/*
	 * Calculate Receiving+Prop+delay
	 */
	// Reset counter to zero before starting for easier timing
	__HAL_TIM_SET_COUNTER(htim, 0);

	HAL_TIM_Base_Start(htim);

	ret = SX1276_Multi_Receiver_Contineous_Receive(hSPI_SX1276, pDataRx, LengthOfDataReceived);

	if(ret !=SX1276_OK)
	{
		// Stop the timer and return to main function
		end = __HAL_TIM_GET_COUNTER(htim);

		HAL_TIM_Base_Stop(htim);

		*ReceivePropDelay= -1.0;

		// Deinit the timer
		HAL_TIM_Base_DeInit(htim);

		return ret;
	}

	end = __HAL_TIM_GET_COUNTER(htim);

	HAL_TIM_Base_Stop(htim);

	*ReceivePropDelay= end*(TIM_PRESCALR*1.0*1e3/ GetTimerClkFromHW());

	// Deinit the timer
	HAL_TIM_Base_DeInit(htim);
	return SX1276_OK;
}

SX1276_StatusTypeDef SX1276_Multi_Receiver_Contineous_Receive(SPI_SX1276_TypeDef hSPI_SX1276,
		uint8_t *pDataRx,
		uint8_t *LengthOfDataReceived)
{
	SX1276_StatusTypeDef ret;
	uint32_t counterToTimeoutReceive=0;
	uint8_t pDataTemp[2]={0};
	uint8_t Flags=0;

	do
	{
		counterToTimeoutReceive++;
		pDataTemp[0] = SX1276_LoRa_REG_IRQ_FLAGS;
		pDataTemp[1] = 0;

		if(SX1276_SPI_Read(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
		{
			return SX1276_SPI_ERROR;
		}

		Flags = pDataTemp[1];
		HAL_Delay(1);

		// If the loop ran for more than 10000ms = 10s => timeout
		if(counterToTimeoutReceive>10000)
		{
			return SX1276_RX_NOTHING_RECEIVED;
		}

	}while(!(Flags>>RxDone & 0x01));



	if( 	(Flags>>ValidHeader & 0x01)	&&
			((Flags>>PayloadCrcError  & 0x01) == 0)		)
	{
		pDataTemp[0] = SX1276_LoRa_REG_OP_MODE;
		pDataTemp[1] = 0;


		// Go do the FIFO read thing
		ret = SX1276_Get_FIFO_Buffer(hSPI_SX1276, pDataRx, LengthOfDataReceived);
		if(ret != SX1276_OK)
		{
			return ret;
		}


		//Clear all flags
		ret = SX1276_ClearAllIRQFlags(hSPI_SX1276);
		if(ret!=SX1276_OK)
		{
			return ret;
		}

	}
	else
	{
		if(Flags>>PayloadCrcError  & 0x01)
		{
			//Clear all flags
			ret = SX1276_ClearAllIRQFlags(hSPI_SX1276);
			if(ret!=SX1276_OK)
			{
				return ret;
			}
			return SX1276_RX_FLAG_CRC_ERROR;
		}
		if(Flags == 0)
		{
			return SX1276_RX_NOTHING_RECEIVED;
		}
	}

	// 9) Set SX1276 to SLEEP
	if(SX1276_SetOperationMode(hSPI_SX1276, SX1276_LoRa_REG_OP_MODE_SLEEP)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}

	return SX1276_OK;
}

SX1276_StatusTypeDef SX1276_Multi_Receiver_Contineous_SetConfiguration(SPI_SX1276_TypeDef hSPI_SX1276,
		uint32_t LoRaFrequnecy_KHz,
		SX1276_CommParam sCommParam)
{
	SX1276_StatusTypeDef ret;
	uint8_t pDataTemp[2]={0};
	// 1) Set SX1276 RF Carrier frequency.
	if(SX1276_SetLoRaFrequency(hSPI_SX1276, LoRaFrequnecy_KHz) !=SX1276_OK)
	{
		return SX1276_ERROR;
	}

	// 2) Set LoRa communication parameter
	ret = SX1276_SetLoRaCommunicationParameter(hSPI_SX1276, sCommParam);
	if(ret!=SX1276_OK)
	{
		return ret;
	}

	// 3) Set SX1276_LoRa_REG_FIFO_RX_BASE_ADDR (RegFifoRxBaseAddr) = 0x00.
	pDataTemp[0] = SX1276_LoRa_REG_FIFO_RX_BASE_ADDR;
	pDataTemp[1] = 0;
	if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}


	// 4) Set SX1276_LoRa_REG_FIFO_ADDR_PTR (RegFifoAddrPtr) = 0x00.
	pDataTemp[0] = SX1276_LoRa_REG_FIFO_ADDR_PTR;
	pDataTemp[1] = 0;
	if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

