artifactsdoubleblind-sys/Regulation_Aware_LoRa_Transmission/STM32_Project/SX1276_Driver/Src/stm32_SX1276_spi.c
	// 5) Set SX1276 to RXCONT mode
	if(SX1276_SetOperationMode(hSPI_SX1276, SX1276_LoRa_REG_OP_MODE_RXCONT)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}

	return SX1276_OK;
}

/*
 * @brief Receive single data packet using LoRa Modem
 * @notes: As per Section 4.1.6 LoRa Modem State Machine Sequences -> Single Reception Operating Mode (Pg 40 of 132)
 * 			1) Set SX1276 RF Carrier frequency.
 * 			2) Set LoRa communication parameter
 * 			3) Set SX1276_LoRa_REG_FIFO_RX_BASE_ADDR (RegFifoRxBaseAddr) = 0x00.
 *			4) Set SX1276_LoRa_REG_FIFO_ADDR_PTR (RegFifoAddrPtr) = 0x00.
 *			5) Set SX1276 to RXCONT mode
 *			6) Wait for Timeout_ms
 *			8) Logic for extracting data:
 * 				|--- Check ValidHeader==1, RxDone==1, RxTimeout==0, PayloadCrcError== 0
 * 					|---If yes, Read the data from buffer
 * 					|---If no, check RxTimeout==1, return SX1276_TIMEOUT; check PayloadCrcError==1, return SX1276_RX_FLAG_CRC_ERROR
 * 			9) Set SX1276 to SLEEP
 *			10) Wait for PostSleepDelay_ms
 *			## * Discard first byte in the array
 * @param
 * 			SX1276 handle
 * 			LoRa Receive frequency
 * 			Timeout in ms
 * 			Communication parameter struct
 * 			Rx Data buffer pointer
 * 			Length of Data received returned via pointer
 * 			Post sleep Delay in ms
 */
SX1276_StatusTypeDef SX1276_ReceiveContineousSingleUse(SPI_SX1276_TypeDef hSPI_SX1276,
		uint32_t LoRaFrequnecy_KHz,
		uint16_t Timeout_ms,
		SX1276_CommParam sCommParam,
		uint8_t *pDataRx,
		uint8_t *LengthOfDataReceived,
		SX1276_DelayType delay,
		uint32_t PostSleepDelay_ms)
{
	SX1276_StatusTypeDef ret;
	uint8_t pDataTemp[2]={0};
	// 1) Set SX1276 RF Carrier frequency.
	if(SX1276_SetLoRaFrequency(hSPI_SX1276, LoRaFrequnecy_KHz) !=SX1276_OK)
	{
		return SX1276_ERROR;
	}

	// 2) Set LoRa communication parameter
	ret = SX1276_SetLoRaCommunicationParameter(hSPI_SX1276, sCommParam);
	if(ret!=SX1276_OK)
	{
		return ret;
	}

	// 3) Set SX1276_LoRa_REG_FIFO_RX_BASE_ADDR (RegFifoRxBaseAddr) = 0x00.
	pDataTemp[0] = SX1276_LoRa_REG_FIFO_RX_BASE_ADDR;
	pDataTemp[1] = 0;
	if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}


	// 4) Set SX1276_LoRa_REG_FIFO_ADDR_PTR (RegFifoAddrPtr) = 0x00.
	pDataTemp[0] = SX1276_LoRa_REG_FIFO_ADDR_PTR;
	pDataTemp[1] = 0;
	if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}


	// 5) Set SX1276 to RXCONT mode
	if(SX1276_SetOperationMode(hSPI_SX1276, SX1276_LoRa_REG_OP_MODE_RXCONT)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}


	uint8_t Flags=0;
	// 7) Wait for Timeout_ms
	if(delay==SYNC_MODE_MCU_HAL_DELAY)
	{
		HAL_Delay(Timeout_ms);
	}
	else
	{
		MCU_STOP_Delay_ms(Timeout_ms, hSPI_SX1276.hrtc_l);
	}


	pDataTemp[0] = SX1276_LoRa_REG_IRQ_FLAGS;
	pDataTemp[1] = 0;

	if(SX1276_SPI_Read(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	Flags = pDataTemp[1];

	if( 	(Flags>>ValidHeader & 0x01)	&&
			(Flags>>RxDone & 0x01)		&&
			((Flags>>PayloadCrcError  & 0x01) == 0)		)
	{
		pDataTemp[0] = SX1276_LoRa_REG_OP_MODE;
		pDataTemp[1] = 0;


		// Go do the FIFO read thing
		ret = SX1276_Get_FIFO_Buffer(hSPI_SX1276, pDataRx, LengthOfDataReceived);
		if(ret != SX1276_OK)
		{
			return ret;
		}


		//Clear all flags
		ret = SX1276_ClearAllIRQFlags(hSPI_SX1276);
		if(ret!=SX1276_OK)
		{
			return ret;
		}

	}
	else
	{
		if(Flags>>PayloadCrcError  & 0x01)
		{
			//Clear all flags
			ret = SX1276_ClearAllIRQFlags(hSPI_SX1276);
			if(ret!=SX1276_OK)
			{
				return ret;
			}
			return SX1276_RX_FLAG_CRC_ERROR;
		}
		if(Flags == 0)
		{
			return SX1276_RX_NOTHING_RECEIVED;
		}
	}

	// 9) Set SX1276 to SLEEP
	if(SX1276_SetOperationMode(hSPI_SX1276, SX1276_LoRa_REG_OP_MODE_SLEEP)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}

	// 10) Wait for PostSleepDelay_ms
	if(delay==SYNC_MODE_MCU_HAL_DELAY)
	{
		HAL_Delay(PostSleepDelay_ms);
	}
	else
	{
		MCU_STOP_Delay_ms(PostSleepDelay_ms, hSPI_SX1276.hrtc_l);
	}

	return SX1276_OK;
}


/*
 * @brief Receive single data packet using LoRa Modem
 * @notes: As per Section 4.1.6 LoRa Modem State Machine Sequences -> Single Reception Operating Mode (Pg 40 of 132)
 * 			1) Set SX1276 RF Carrier frequency.
 * 			2) Set LoRa communication parameter
 * 			3) Set SX1276_LoRa_REG_FIFO_RX_BASE_ADDR (RegFifoRxBaseAddr) = 0x00.
 *			4) Set SX1276_LoRa_REG_FIFO_ADDR_PTR (RegFifoAddrPtr) = 0x00.
 *			5) Set SX1276 RxTimeout
 *			6) Set SX1276 to RXSINGLE mode
 *			7) Wait for Timeout_ms
 *			8) Check the OP MODE => shall go back to STDBY
 *			9) Logic for extracting data:
 * 				+ Check the IRQ flag; if ValidHeader==1
 * 				|---If yes, check ValidHeader==1, RxDone==1, RxTimeout==0, PayloadCrcError== 0
 * 					|---If yes, Read the data from buffer
 * 					|---If no, check RxTimeout==1, return SX1276_TIMEOUT; check PayloadCrcError==1, return SX1276_RX_FLAG_CRC_ERROR
 * 				|---If no, check RxTimeout==1, return SX1276_TIMEOUT; check PayloadCrcError==1, return SX1276_RX_FLAG_CRC_ERROR
 * 			10) Set SX1276 to SLEEP
 *
 *			## * Discard first byte in the array
 * @param
 * 			SX1276 handle
 * 			LoRa Receive frequency
 * 			Timeout in ms
 * 			Communication parameter struct
 * 			Rx Data buffer pointer
 * 			Length of Data received returned via pointer
 */
SX1276_StatusTypeDef SX1276_ReceiveSingle(SPI_SX1276_TypeDef hSPI_SX1276,
		uint32_t LoRaFrequnecy_KHz,
		uint16_t Timeout_ms,
		SX1276_CommParam sCommParam,
		uint8_t *pDataRx,
		SX1276_DelayType delay,
		uint8_t *LengthOfDataReceived)
{
	SX1276_StatusTypeDef ret;
	uint8_t pDataTemp[2]={0};
	// 1) Set SX1276 RF Carrier frequency.
	if(SX1276_SetLoRaFrequency(hSPI_SX1276, LoRaFrequnecy_KHz) !=SX1276_OK)
	{
		return SX1276_ERROR;
	}

	ret = SX1276_SetLoRaCommunicationParameter(hSPI_SX1276, sCommParam);
	if(ret!=SX1276_OK)
	{
		return ret;
	}

	// 2) Set SX1276_LoRa_REG_FIFO_RX_BASE_ADDR (RegFifoRxBaseAddr) = 0x00.
	pDataTemp[0] = SX1276_LoRa_REG_FIFO_RX_BASE_ADDR;
	pDataTemp[1] = 0;
	if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}


	// 3) Set SX1276_LoRa_REG_FIFO_ADDR_PTR (RegFifoAddrPtr) = 0x00.
	pDataTemp[0] = SX1276_LoRa_REG_FIFO_ADDR_PTR;
	pDataTemp[1] = 0;
	if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	// 4) Set RxTimeout
	ret = SX1276_SetRxTimeout(hSPI_SX1276, Timeout_ms, sCommParam);
	if(ret != SX1276_OK)
	{
		return ret;
	}

	// 5) Set SX1276 to RXSINGLE mode
	if(SX1276_SetOperationMode(hSPI_SX1276, SX1276_LoRa_REG_OP_MODE_RXSINGLE)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}

	// 6) Wait for Timeout_ms
	if(delay==SYNC_MODE_MCU_HAL_DELAY)
	{
		HAL_Delay(ComputeToA(sCommParam, 240));
	}
	else
	{
		MCU_STOP_Delay_ms(ComputeToA(sCommParam, 240), hSPI_SX1276.hrtc_l);
	}

	pDataTemp[0] = SX1276_LoRa_REG_OP_MODE;
	pDataTemp[1] = 0;
	uint8_t temp1 = pDataTemp[1];

	// 7) Check the OP MODE => shall go back to STDBY
	while(temp1!= SX1276_LoRa_REG_OP_MODE_STDBY)
	{
		pDataTemp[0] = SX1276_LoRa_REG_OP_MODE;
		pDataTemp[1] = 0;
		if(SX1276_SPI_Read(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
		{
			return SX1276_SPI_ERROR;
		}
		temp1= pDataTemp[1];
	}

