artifactsdoubleblind-sys/Regulation_Aware_LoRa_Transmission/STM32_Project/SX1276_Driver/Src/stm32_SX1276_spi.c
	/*
	 * 8) Logic for extracting data:
	 * 		+ Check the IRQ flag; if ValidHeader==1
	 * 		|---If yes, check ValidHeader==1, RxDone==1, RxTimeout==0, PayloadCrcError== 0
	 * 			|---If yes, Read the data from buffer
	 * 			|---If no, check RxTimeout==1, return SX1276_TIMEOUT; check PayloadCrcError==1, return SX1276_RX_FLAG_CRC_ERROR
	 * 		|---If no, check RxTimeout==1, return SX1276_TIMEOUT; check PayloadCrcError==1, return SX1276_RX_FLAG_CRC_ERROR
	 */
	pDataTemp[0] = SX1276_LoRa_REG_IRQ_FLAGS;
	pDataTemp[1] = 0;
	uint8_t Flags=0;


	if(SX1276_SPI_Read(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	Flags = pDataTemp[1];

	// Valid Reception

	if(Flags>>ValidHeader & 0x01)
	{
		/*
		 * Sometimes, it takes time for SX1276 to demodulate the signal; i.e.
		 * ValidHeader will be raised before RxDone.
		 * So, we check the IRQ flag again, we wait for sometime before checking the flag
		 * ## the delay is based on experimentations.
		 */
		if(delay==SYNC_MODE_MCU_HAL_DELAY)
		{
			HAL_Delay(2*ComputeToA(sCommParam, 240));
		}
		else
		{
			MCU_STOP_Delay_ms(2*ComputeToA(sCommParam, 240), hSPI_SX1276.hrtc_l);
		}


		pDataTemp[0] = SX1276_LoRa_REG_IRQ_FLAGS;
		pDataTemp[1] = 0;

		if(SX1276_SPI_Read(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
		{
			return SX1276_SPI_ERROR;
		}

		Flags = pDataTemp[1];

		if( 	(Flags>>ValidHeader & 0x01)	&&
				(Flags>>RxDone & 0x01)		&&
				((Flags>>RxTimeout  & 0x01) == 0) 	&&
				((Flags>>PayloadCrcError  & 0x01) == 0)		)
		{
			pDataTemp[0] = SX1276_LoRa_REG_OP_MODE;
			pDataTemp[1] = 0;
			uint8_t temp = pDataTemp[1];

			while(temp!= SX1276_LoRa_REG_OP_MODE_STDBY)
			{
				pDataTemp[0] = SX1276_LoRa_REG_OP_MODE;
				pDataTemp[1] = 0;
				if(SX1276_SPI_Read(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
				{
					return SX1276_SPI_ERROR;
				}
				temp = pDataTemp[1];
			}


			// Go do the FIFO read thing
			ret = SX1276_Get_FIFO_Buffer(hSPI_SX1276, pDataRx, LengthOfDataReceived);
			if(ret != SX1276_OK)
			{
				return ret;
			}

			//Clear all flags
			ret = SX1276_ClearAllIRQFlags(hSPI_SX1276);
			if(ret!=SX1276_OK)
			{
				return ret;
			}

		}
		else
		{
			if(Flags>>RxTimeout  & 0x01)
			{
				//Clear all flags
				ret = SX1276_ClearAllIRQFlags(hSPI_SX1276);
				if(ret!=SX1276_OK)
				{
					return ret;
				}
				//HAL_Delay(10);
				return SX1276_TIMEOUT;
			}
			if(Flags>>PayloadCrcError  & 0x01)
			{
				//Clear all flags
				ret = SX1276_ClearAllIRQFlags(hSPI_SX1276);
				if(ret!=SX1276_OK)
				{
					return ret;
				}
				return SX1276_RX_FLAG_CRC_ERROR;
			}
		}

	}
	else
	{
		if(Flags>>RxTimeout  & 0x01)
		{
			//Clear all flags
			ret = SX1276_ClearAllIRQFlags(hSPI_SX1276);
			if(ret!=SX1276_OK)
			{
				return ret;
			}
			//HAL_Delay(10);
			return SX1276_TIMEOUT;
		}
		if(Flags>>PayloadCrcError  & 0x01)
		{
			//Clear all flags
			ret = SX1276_ClearAllIRQFlags(hSPI_SX1276);
			if(ret!=SX1276_OK)
			{
				return ret;
			}
			return SX1276_RX_FLAG_CRC_ERROR;
		}
	}

	// 10) Set SX1276 to SLEEP
	if(SX1276_SetOperationMode(hSPI_SX1276, SX1276_LoRa_REG_OP_MODE_SLEEP)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}

	return SX1276_OK;
}


/*
 * @brief Read FIFO data buffer for data transmission
 * @notes As per Section 4.1.6 Payload Data Extraction from FIFO, Pg 41 of 132
 * 				i)		Check if ValidHeader, RxDone and PayloadCrcError interrupts in the status register RegIrqFlags are not asserted
 * 				ii) 	Set SX1276_LoRa_REG_FIFO_RX_BASE_ADDR (RegFifoRxBaseAddr) = 0x00.
 * 						This is done to so that full FIFO data buffer (256 Bytes) can be utilized.
 * 				iii)	Set SX1276_LoRa_REG_FIFO_ADDR_PTR (RegFifoAddrPtr) = 0x00.
 * 						This is where we want to start entering data in the FIFO data buffer.
 * 				iv)		Read the SX1276_LoRa_REG_FIFO_RX_CURRENT_ADDR value.
 * 				v)		Read the FIFO address.
 *
 * @param
 * 			SX1276 handle
 * 			FIFO Addr + Data
 */
SX1276_StatusTypeDef SX1276_Get_FIFO_Buffer(SPI_SX1276_TypeDef hSPI_SX1276, uint8_t *pDataRx, uint8_t *ptr_vardat_SX1276_LoRa_REG_RX_NB_BYTES)
{
	uint8_t pData[2] ={SX1276_LoRa_REG_RX_NB_BYTES, 0x00};


	// 2) Read SX1276_LoRa_REG_RX_NB_BYTES (RegRxNbBytes)
	uint8_t vardat_SX1276_LoRa_REG_RX_NB_BYTES=0;
	if(SX1276_SPI_Read(hSPI_SX1276, pData, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}
	vardat_SX1276_LoRa_REG_RX_NB_BYTES = pData[1];


	// 3) Read SX1276_LoRa_REG_FIFO_RX_CURRENT_ADDR (RegFifoRxCurrentAddr)
	pData[0] = SX1276_LoRa_REG_FIFO_RX_CURRENT_ADDR;
	pData[1] = 0;
	if(SX1276_SPI_Read(hSPI_SX1276, pData, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	// 4) Set SX1276_LoRa_REG_FIFO_ADDR_PTR (RegFifoAddrPtr) = SX1276_LoRa_REG_FIFO_RX_CURRENT_ADDR (RegFifoRxCurrentAddr)
	pData[0] = SX1276_LoRa_REG_FIFO_ADDR_PTR;
	if(SX1276_SPI_Write(hSPI_SX1276, pData, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	// 5) Read the FIFO data
	pDataRx[0] = 0x00;
	if(SX1276_SPI_Read(hSPI_SX1276, pDataRx, vardat_SX1276_LoRa_REG_RX_NB_BYTES)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	*ptr_vardat_SX1276_LoRa_REG_RX_NB_BYTES = vardat_SX1276_LoRa_REG_RX_NB_BYTES;


	return SX1276_OK;
}

/*
 * @brief Sets RX Timeout register
 * @notes
 * 			Setting this register DOES NOT seem to do anything.
 * 			The flag is always raised at 32us (SPI running at 20 MBits/s)
 * 			Conclusion: Timeout duration cannot be changed.
 * @param
 * 		- SX1276 SPI handle
 * 		- Timeout in ms
 * 		- Communication Paramets struct
 *
 */
SX1276_StatusTypeDef SX1276_SetRxTimeout(SPI_SX1276_TypeDef hSPI_SX1276, uint16_t Timeout_ms, SX1276_CommParam sCommParam)
{
	// 1) Compute the Ts
	uint16_t temp = 1;
	temp = temp<<(sCommParam.Spreadfactor>>4);
	float Ts_ms =  (temp/getBandwidth(sCommParam.Bandwidth));

	uint16_t SymbTimeout = (uint16_t)(Timeout_ms/Ts_ms);

	// 2) Check if the values is actually less than OxFFF
	if(SymbTimeout > 0x3FF)
	{
		return SX1276_PROGRAM_ERROR;
	}

	// 3) Set the registers
	uint8_t pDataTemp[2]={SX1276_LoRa_REG_SYMB_TIMEOUT_LSB, (SymbTimeout & 0x00FF)};
	if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	pDataTemp[0] = SX1276_LoRa_REG_MODEM_CONFIG_2;
	pDataTemp[1] = 0;
	if(SX1276_SPI_Read(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

