artifactsdoubleblind-sys/Regulation_Aware_LoRa_Transmission/STM32_Project/SX1276_Driver/Src/stm32_SX1276_spi.c
	pDataTemp[1] &= 0b11111100;
	pDataTemp[1] |= (SymbTimeout>>8) & (0x03);

	if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}



	return SX1276_OK;

}

/*
 * @brief Set config for data transmission
 * @notes	First part of SX1276_Transmit function
 * 			IMPORTANT: Takes ~90ms to execute for SPI @5MBits/s
 *
 * 			* Keep the first byte empty
 * @param
 * 			SX1276 handle
 * 			FIFO Addr + Data
 * 			Length of Tx data
 */
SX1276_StatusTypeDef SX1276_Multi_Transmitter_SetConfiguration(SPI_SX1276_TypeDef hSPI_SX1276,
		uint8_t *pDataTx,
		uint8_t TxDataLength,
		uint32_t LoRaFrequnecy_KHz,
		uint8_t TxPower,
		SX1276_CommParam sCommParam)
{
	uint8_t pDataTemp[2]={0};
	// 1) Set SX1276 RF Carrier frequency.
	if(SX1276_SetLoRaFrequency(hSPI_SX1276, LoRaFrequnecy_KHz) !=SX1276_OK)
	{
		return SX1276_ERROR;
	}

	// 2) Fill LoRa FIFO data buffer
	if(SX1276_Set_FIFO_Buffer(hSPI_SX1276, pDataTx, TxDataLength)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}

	// 3) Set PA Config to 1 (NiceRF requirement)
	pDataTemp[0] = SX1276_LoRa_REG_PA_CONFIG;
	pDataTemp[1] = TxPower;
	if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	// 4) Set Communication Parameter
	if(SX1276_SetLoRaCommunicationParameter(hSPI_SX1276, sCommParam)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}

	return SX1276_OK;
}

/*
 * @brief Transmit Data using LoRa Modem after configuration is complete
 * @notes: 	Second part of SX1276_Transmit function
 *			Takes ToA
 * 			* Keep the first byte empty
 * @param
 * 			SX1276 handle
 * 			Length of Tx data
 */
SX1276_StatusTypeDef SX1276_Multi_Transmitter_Transmit(SPI_SX1276_TypeDef hSPI_SX1276,
		uint8_t TxDataLength,
		SX1276_DelayType delay,
		SX1276_CommParam sCommParam)
{
	// 4) Transmit
	if(SX1276_SetOperationMode(hSPI_SX1276, SX1276_LoRa_REG_OP_MODE_TX)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}

	// Wait for transmission to complete
	if(delay==SYNC_MODE_MCU_HAL_DELAY)
	{
		HAL_Delay(ComputeToA(sCommParam, TxDataLength));
	}
	else
	{
		MCU_STOP_Delay_ms(ComputeToA(sCommParam, TxDataLength), hSPI_SX1276.hrtc_l);
	}

	// 5) Clear TxDone IRQ flag
	if(SX1276_ClearIRQFlags(hSPI_SX1276, TxDone)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}


	// 6) Set SX1276 to Sleep
	if(SX1276_SetOperationMode(hSPI_SX1276, SX1276_LoRa_REG_OP_MODE_SLEEP)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}




	return SX1276_OK;
}


/*
 * @brief Transmit Data using LoRa Modem
 * @notes: As per Section 4.1.6 LoRa Modem State Machine Sequences -> Data Transmission Sequence (Pg 38 of 132)
 * 			1) Set SX1276 RF Carrier frequency.
 * 			2) Fill LoRa FIFO data buffer
 * 			3) Set Transmit Power
 * 			4) Set CommParam
 * 			5) Transmit
 * 			6) Put SX1276 in Sleep Mode (FIFO is cleared)
 *
 * 			* Keep the first byte empty
 * @param
 * 			SX1276 handle
 * 			FIFO Addr + Data
 * 			Length of Tx data
 */
SX1276_StatusTypeDef SX1276_Transmit(SPI_SX1276_TypeDef hSPI_SX1276,
		uint8_t *pDataTx,
		uint8_t TxDataLength,
		uint32_t LoRaFrequnecy_KHz,
		uint8_t TxPower,
		SX1276_DelayType delay,
		SX1276_CommParam sCommParam)
{
	uint8_t pDataTemp[2]={0};
	// 1) Set SX1276 RF Carrier frequency.
	if(SX1276_SetLoRaFrequency(hSPI_SX1276, LoRaFrequnecy_KHz) !=SX1276_OK)
	{
		return SX1276_ERROR;
	}

	// 2) Fill LoRa FIFO data buffer
	if(SX1276_Set_FIFO_Buffer(hSPI_SX1276, pDataTx, TxDataLength)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}

	// 3) Set PA Config to 1 (NiceRF requirement)
	pDataTemp[0] = SX1276_LoRa_REG_PA_CONFIG;
	pDataTemp[1] = TxPower;
	if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	// 4) Set Communication Parameter
	if(SX1276_SetLoRaCommunicationParameter(hSPI_SX1276, sCommParam)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}


	// 4) Transmit
	if(SX1276_SetOperationMode(hSPI_SX1276, SX1276_LoRa_REG_OP_MODE_TX)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}

	// Wait for transmission to complete

	if(delay==SYNC_MODE_MCU_HAL_DELAY)
	{
		HAL_Delay(ComputeToA(sCommParam, TxDataLength));
	}
	else
	{
		MCU_STOP_Delay_ms(ComputeToA(sCommParam, TxDataLength), hSPI_SX1276.hrtc_l);
	}


	// 5) Clear TxDone IRQ flag
	if(SX1276_ClearIRQFlags(hSPI_SX1276, TxDone)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}


	// 6) Set SX1276 to Sleep
	if(SX1276_SetOperationMode(hSPI_SX1276, SX1276_LoRa_REG_OP_MODE_SLEEP)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}


	return SX1276_OK;
}

uint32_t ComputeToA(SX1276_CommParam sCommParam, uint8_t TxDataLength)
{
	uint16_t temp = 1;
	temp = temp<<(sCommParam.Spreadfactor>>4);
	float Ts_ms =  (temp/getBandwidth(sCommParam.Bandwidth));

	float Tpreamble_ms = (sCommParam.PreambleLength + 4.25)*Ts_ms;

	float n_Payload = ( 8*(TxDataLength-1) - 4*(sCommParam.Spreadfactor>>4) + 28 +16);
	n_Payload = ((float)n_Payload/(float)(4*(sCommParam.Spreadfactor>>4)));
	n_Payload = ceil(n_Payload) * (4 + (sCommParam.CodingRate>>1));
	n_Payload =  8 + fmax(n_Payload, 0.0);

	float Tpayload_ms = n_Payload * Ts_ms;

	uint32_t ToA_ms = ceil(Tpayload_ms + Tpreamble_ms);

	ToA_ms +=10;		// When making measurements, a discrepancy of +/- >10ms was found

	return ToA_ms;
}


float getBandwidth(uint8_t regVal)
{
	switch (regVal) {
	case SX1276_LoRa_REG_MODEM_CONFIG1_BW_7_8_kHz:    return 7.8;
	case SX1276_LoRa_REG_MODEM_CONFIG1_BW_10_4_kHz:   return 10.4;
	case SX1276_LoRa_REG_MODEM_CONFIG1_BW_15_6_kHz:   return 15.6;
	case SX1276_LoRa_REG_MODEM_CONFIG1_BW_20_8_kHz:   return 20.8;
	case SX1276_LoRa_REG_MODEM_CONFIG1_BW_31_25_kHz:  return 31.25;
	case SX1276_LoRa_REG_MODEM_CONFIG1_BW_41_7_kHz:   return 41.7;
	case SX1276_LoRa_REG_MODEM_CONFIG1_BW_62_5_kHz:   return 62.5;
	case SX1276_LoRa_REG_MODEM_CONFIG1_BW_125_kHz:    return 125.0;
	case SX1276_LoRa_REG_MODEM_CONFIG1_BW_250_kHz:    return 250.0;
	case SX1276_LoRa_REG_MODEM_CONFIG1_BW_500_kHz:    return 500.0;
	default:                                          return -1.0; // Unknown value
	}
}

uint32_t GetTimerClkFromHW(void)
{
	uint32_t hclk = HAL_RCC_GetHCLKFreq();
	uint32_t ppre2 = (RCC->CFGR & RCC_CFGR_PPRE2) >> RCC_CFGR_PPRE2_Pos;

	uint32_t apb2_prescaler;

	if (ppre2 < 4)
		apb2_prescaler = 1;
	else {
		switch (ppre2) {
		case 4: apb2_prescaler = 2; break;
		case 5: apb2_prescaler = 4; break;
		case 6: apb2_prescaler = 8; break;
		case 7: apb2_prescaler = 16; break;
		default: apb2_prescaler = 1; break;
		}
	}

	uint32_t pclk2 = hclk / apb2_prescaler;

	if (apb2_prescaler == 1)
		return pclk2;
	else
		return 2 * pclk2;
}

float measure_function_time_us(TIM_HandleTypeDef *htim, uint32_t TIM_PRESCALR)
{
	uint16_t end;

	// Reset counter to zero before starting for easier timing
	__HAL_TIM_SET_COUNTER(htim, 0);

	HAL_TIM_Base_Start(htim);

	HAL_Delay(1000);
	//MCU_STOP_Delay_ms(100);

	end = __HAL_TIM_GET_COUNTER(htim);

	HAL_TIM_Base_Stop(htim);

	return end*(TIM_PRESCALR*1.0/ GetTimerClkFromHW());
}

void MCU_STOP_Delay_ms(uint32_t ms, RTC_HandleTypeDef *hrtc_loc)
{
	/*
	 * Ref: https://community.st.com/t5/stm32-mcus/how-to-configure-the-rtc-to-wake-up-the-stm32-periodically-from/ta-p/49836
	 */
	HAL_SuspendTick();
	/*
	 *  The RTC is fed via LSI (32MHz)
	 *  if ms*2 were = 1, then the interupt for waking up MCU would ben programmed for DIV16 (=16)
	 *   = 16/32 ms=0.5ms*ms*2=0.5ms * 1 = 0.5ms
	 */
	HAL_RTCEx_SetWakeUpTimer_IT(hrtc_loc, ms*2, RTC_WAKEUPCLOCK_RTCCLK_DIV16);

	/* Enter STOP 2 mode */
	HAL_PWREx_EnterSTOP2Mode(PWR_STOPENTRY_WFI);
	HAL_RTCEx_DeactivateWakeUpTimer(hrtc_loc);
	SystemClock_Config();
	HAL_ResumeTick();
}

