artifactsdoubleblind-sys/Regulation_Aware_LoRa_Transmission/STM32_Project/SX1276_Driver/Src/stm32_SX1276_spi.c
/*
 * @brief Sets Bandwidth, Coding Rate and Spread Factor
 * @param
 * 	- SX1276 handle
 * 	- CommParam struct
 */
SX1276_StatusTypeDef SX1276_SetLoRaCommunicationParameter(SPI_SX1276_TypeDef hSPI_SX1276, SX1276_CommParam sCommParam)
{
	uint8_t pDataTemp[2] = {SX1276_LoRa_REG_MODEM_CONFIG_1, (sCommParam.Bandwidth | sCommParam.CodingRate)};
	if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	if(sCommParam.Spreadfactor == SX1276_LoRa_REG_MODEM_CONFIG2_SF6)
	{
		pDataTemp[0] = SX1276_LoRa_REG_DETECT_OPTIMIZE;
		pDataTemp[1] = 0x05;
		if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
		{
			return SX1276_SPI_ERROR;
		}

		pDataTemp[0] = SX1276_LoRa_REG_DETECTION_THRSEHOLD;
		pDataTemp[1] = 0x0C;
		if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
		{
			return SX1276_SPI_ERROR;
		}

	}
	else
	{
		pDataTemp[0] = SX1276_LoRa_REG_DETECT_OPTIMIZE;
		pDataTemp[1] = 0x03;
		if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
		{
			return SX1276_SPI_ERROR;
		}

		pDataTemp[0] = SX1276_LoRa_REG_DETECTION_THRSEHOLD;
		pDataTemp[1] = 0x0A;
		if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
		{
			return SX1276_SPI_ERROR;
		}
	}

	pDataTemp[0] = SX1276_LoRa_REG_MODEM_CONFIG_2;
	pDataTemp[1] = sCommParam.Spreadfactor;
	if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	pDataTemp[0] = SX1276_LoRa_REG_SYMB_PREAMBLE_MSB;
	pDataTemp[1] = sCommParam.PreambleLength>>8;
	if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	pDataTemp[0] = SX1276_LoRa_REG_SYMB_PREAMBLE_LSB;
	pDataTemp[1] = sCommParam.PreambleLength;
	if(SX1276_SPI_Write(hSPI_SX1276, pDataTemp, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}


	return SX1276_OK;

}

/*
 * @brief Get IRQ flag
 * @param
 * 		SX1276 handle
 * 		Send the flag that needs to be checked
 */
SX1276_StatusTypeDef SX1276_GetIRQFlags(SPI_SX1276_TypeDef hSPI_SX1276, SX1276_IRQFlags Flag, uint8_t *ptrFlagData)
{
	uint8_t pDataR[2]={SX1276_LoRa_REG_IRQ_FLAGS , 0x00};
	if(SX1276_SPI_Read(hSPI_SX1276, pDataR, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	*ptrFlagData = pDataR[1]>>Flag;

	return SX1276_OK;
}


/*
 * @brief Clears IRQ flag
 * @param
 * 		SX1276 handle
 * 		Send the flag that needs to be cleared
 */
SX1276_StatusTypeDef SX1276_ClearIRQFlags(SPI_SX1276_TypeDef hSPI_SX1276, SX1276_IRQFlags Flag)
{
	uint8_t pDataR[2]={SX1276_LoRa_REG_IRQ_FLAGS , 0x01<<Flag};
	return SX1276_SPI_Write(hSPI_SX1276, pDataR, 2);
}

/*
 * @brief Clears All IRQ flag
 * @param
 * 		SX1276 handle
 */
SX1276_StatusTypeDef SX1276_ClearAllIRQFlags(SPI_SX1276_TypeDef hSPI_SX1276)
{
	uint8_t pDataR[2]={SX1276_LoRa_REG_IRQ_FLAGS , 0xFF};
	return SX1276_SPI_Write(hSPI_SX1276, pDataR, 2);
}



/*
 * @brief Fill FIFO data buffer for data transmission
 * @notes As per Section 4.1.2.3 LoRa Mode FIFO Data Buffer, Pg 34 of 132
 * 				i)		Set SX1276 in Standby mode.
 * 				ii) 	Set SX1276_LoRa_REG_FIFO_TX_BASE_ADDR (RegFifoTxBaseAddr) = 0x00.
 * 						This is done to so that full FIFO data buffer (256 Bytes) can be utilized.
 * 				iii)	Set SX1276_LoRa_REG_PAYLOAD_LENGTH (RegPayloadLength) to size of data to be transmitted.
 * 				iv)		Set SX1276_LoRa_REG_FIFO_ADDR_PTR (RegFifoAddrPtr) = 0x00.
 * 						This is where we want to start entering data in the FIFO data buffer.
 * 				v)		Send it to RegFifo
 * 						THE pDataTx first element shall be SX1276_LoRa_REG_FIFO (RegFifo).

 * @param
 * 			SX1276 handle
 * 			FIFO Addr + Data
 * 			Length of Tx data
 */
SX1276_StatusTypeDef SX1276_Set_FIFO_Buffer(SPI_SX1276_TypeDef hSPI_SX1276, uint8_t *pDataTx, uint8_t TxDataLength)
{
	uint8_t pData[2] ={0};

	// 1) Set SX1276 in Standby mode
	if(SX1276_SetOperationMode(hSPI_SX1276, SX1276_LoRa_REG_OP_MODE_STDBY)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}

	// 2) Set SX1276_LoRa_REG_FIFO_TX_BASE_ADDR (RegFifoTxBaseAddr) = 0x00.
	pData[0] = SX1276_LoRa_REG_FIFO_TX_BASE_ADDR;
	pData[1] = 0;
	if(SX1276_SPI_Write(hSPI_SX1276, pData, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	// 3) Set SX1276_LoRa_REG_PAYLOAD_LENGTH (RegPayloadLength) to size of data to be transmitted.
	pData[0] = SX1276_LoRa_REG_PAYLOAD_LENGTH;
	pData[1] = TxDataLength;
	if(SX1276_SPI_Write(hSPI_SX1276, pData, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	// 4) Set SX1276_LoRa_REG_FIFO_ADDR_PTR (RegFifoAddrPtr) = 0x00.
	pData[0] = SX1276_LoRa_REG_FIFO_ADDR_PTR;
	pData[1] = 0;
	if(SX1276_SPI_Write(hSPI_SX1276, pData, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	// 5) Write to FIFO data buffer
	pDataTx[0] = 0x00;
	if(SX1276_SPI_Write(hSPI_SX1276, pDataTx, TxDataLength)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	return SX1276_OK;
}

/*
 * @brief Set LoRa RF carrier frequency
 * @param
 * 			SX1276 handle
 * 			Frequency in KHz
 *
 */
SX1276_StatusTypeDef SX1276_SetLoRaFrequency(SPI_SX1276_TypeDef hSPI_SX1276, uint32_t LoRaFrequnecy_KHz)
{

	/*--Use this incase of custom crystal
	 * // For Now lets assume XOSC is 32 MHz
	 * uint32_t Fstep= 32000000;
	 * Fstep = (uint32_t)((float)(LoRaFrequnecy_KHz*1e3) / ((float)(Fstep>>19)));
	 */

	//For NiceRF
	uint32_t Fstep = (uint32_t)(LoRaFrequnecy_KHz*16.384);

	uint8_t pData[4]={0};
	pData[0] = SX1276_LoRa_REG_FR_MSB;
	pData[1] = (Fstep & 0xFF0000)>>16;
	pData[2] = (Fstep & 0xFF00)>>8;
	pData[3] = (Fstep & 0xFF);

	// Set SX1276 to Standby mode
	if(SX1276_SetOperationMode(hSPI_SX1276, SX1276_LoRa_REG_OP_MODE_STDBY)!=SX1276_OK)
	{
		return SX1276_ERROR;
	}

	if(SX1276_SPI_Write(hSPI_SX1276, pData, 4)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}
	return SX1276_OK;

}


/*
 * @brief Set SX1276 to a paricular mode
 *
 * @param
 * 		 SX1276 handle
 * 		 SX1276 Mode
 */
SX1276_StatusTypeDef SX1276_SetOperationMode(SPI_SX1276_TypeDef hSPI_SX1276, uint8_t Mode)
{
	if((Mode & 0b00000111)>7)
	{
		return SX1276_PROGRAM_ERROR;
	}
	uint8_t pDataR[2]={0};

	pDataR[0] = SX1276_LoRa_REG_OP_MODE;
	pDataR[1] = Mode;

	if(SX1276_SPI_Write(hSPI_SX1276, pDataR, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}
	return SX1276_OK;


