artifactsdoubleblind-sys/Regulation_Aware_LoRa_Transmission/STM32_Project/SX1276_Driver/Src/stm32_SX1276_spi.c
}
/**
 * @brief SX1276 Init function
 *  0)	Do manual reset
 * 	1)	Set the RegOpMode (0x01) Register
 * 			- In sleep mode
 * 			- Low frequency mode
 * 	2)	Read the RegOpMode (0x01) Register, check if the register content is same.
 * 	3) 	Set PA Config to 1 (NiceRF Requirement)
 * 	@param SX1276 handle:
 * 		- Chip select port
 * 		- Chip select pin
 * 		- SPI handle
 */
SX1276_StatusTypeDef SX1276_Init(SX1276_Init_Param h_SX1276)
{
	uint8_t pData[2]={0};
	uint8_t pDataR[2]={0};


//	// 0)	Write/read dummy data from reg to check if SX1276 is connected or not
//	pData[0] = SX1276_LoRa_REG_FIFO_ADDR_PTR;
//	pData[1] = 0x6F;
//	if(SX1276_SPI_Write(h_SX1276.SPI_SX1276, pData, 2)!=SX1276_OK)
//	{
//		return SX1276_SPI_ERROR;
//	}
//
//	pData[1] = 0x6F;
//	pDataR[0] = SX1276_LoRa_REG_FIFO_ADDR_PTR;
//
//	if( (SX1276_SPI_Read(h_SX1276.SPI_SX1276, pDataR, 2)!=SX1276_OK) || (pDataR[1] != pData[1]) )
//	{
//		return SX1276_NC_ERROR;
//	}


	// 1) Sets SX1276 register
	pData[0] = SX1276_LoRa_REG_OP_MODE;
	pData[1] = SX1276_LoRa_REG_OP_MODE_SLEEP;

	if(SX1276_SPI_Write(h_SX1276.SPI_SX1276, pData, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	//HAL_Delay(1000);

	// 2) Read SX1276 register
	pDataR[0] = SX1276_LoRa_REG_OP_MODE;

	if( (SX1276_SPI_Read(h_SX1276.SPI_SX1276, pDataR, 2)!=SX1276_OK) || ((pDataR[1] && 0b00000111) != (pData[1] && 0b00000111)) )
	{
		return SX1276_SPI_ERROR;
	}

	// 3) Set PA Config to 1 (NiceRF requirement)
	pData[0] = SX1276_LoRa_REG_PA_CONFIG;
	pData[1] = SX1276_LoRa_PA_CONFIG_OP_POWER_dBm_17;
	if(SX1276_SPI_Write(h_SX1276.SPI_SX1276, pData, 2)!=SX1276_OK)
	{
		return SX1276_SPI_ERROR;
	}

	return SX1276_OK;
}
/*
 * @brief SX1276 wrap for SPI Write
 * @notes
 * 		-	pData[0] shall be the SX1276 register address
 * 		-	DataLength shall be number of register writes + 1 or  sizeof(pData)
 * @param
 * 	- SX1276 handle
 * 	- Data register location
 * 	- Length of data
 */

SX1276_StatusTypeDef SX1276_SPI_Write(SPI_SX1276_TypeDef hSPI_SX1276, uint8_t *pData, uint16_t DataLength)
{
	HAL_StatusTypeDef ret;

	pData[0] |= 0b10000000;										// As per data sheet, write bit needs to be set
	HAL_GPIO_WritePin(hSPI_SX1276.NSS_GPIOx, hSPI_SX1276.NSS_GPIO_Pin, GPIO_PIN_RESET);
	ret = HAL_SPI_Transmit(hSPI_SX1276.hspi, pData, DataLength, 10);
	HAL_GPIO_WritePin(hSPI_SX1276.NSS_GPIOx, hSPI_SX1276.NSS_GPIO_Pin, GPIO_PIN_SET);

	if(ret!=HAL_OK)
	{
		return SX1276_SPI_ERROR;
	}

	return SX1276_OK;
}

/*
 * @brief SX1276 wrap for SPI Read
 * @notes
 * 		-	pData[0] shall be the SX1276 register address
 * 		-	DataLength shall be number of register read + 1 or  sizeof(pData)
 * @param
 * 	- SX1276 handle
 * 	- Data register location
 * 	- Length of data
 */
SX1276_StatusTypeDef SX1276_SPI_Read(SPI_SX1276_TypeDef hSPI_SX1276, uint8_t *pData, uint16_t DataLength)
{
	HAL_StatusTypeDef ret;

	pData[0] &= 0b01111111;										// As per data sheet, read bit needs to be set
	HAL_GPIO_WritePin(hSPI_SX1276.NSS_GPIOx, hSPI_SX1276.NSS_GPIO_Pin, GPIO_PIN_RESET);
	ret = HAL_SPI_Receive(hSPI_SX1276.hspi, pData, DataLength, 10);
	HAL_GPIO_WritePin(hSPI_SX1276.NSS_GPIOx, hSPI_SX1276.NSS_GPIO_Pin, GPIO_PIN_SET);

	if(ret!=HAL_OK)
	{
		return SX1276_SPI_ERROR;
	}

	return SX1276_OK;
}
